import math

N = 181
arr = [135, 133, 124, 132, 104, 152, 134, 130, 129, 120, 122, 124,
       117, 123, 123, 129, 121, 122, 125, 131, 147, 124, 137, 112,
       126, 128, 111, 129, 115, 147, 131, 132, 137, 119, 125, 120,
       129, 125, 123, 127, 132, 118, 133, 132, 132, 134, 131, 120,
       135, 132, 125, 132, 108, 114, 121, 133, 133, 135, 131, 125,
       114, 115, 122, 131, 125, 132, 120, 126, 115, 117, 118, 188,
       132, 134, 127, 127, 124, 135, 128, 127, 115, 144, 129, 120,
       137, 127, 125, 116, 132, 120, 117, 127, 118, 109, 127, 122,
       120, 135, 116, 118, 133, 136, 125, 126, 119, 126, 129, 127,
       129, 124, 127, 132, 126, 131, 127, 130, 126, 124, 135, 127,
       124, 123, 123, 130, 132, 143, 122, 139, 120, 134, 108, 132,
       121, 111, 123, 140, 137, 120, 125, 131, 118, 120, 120, 136,
       129, 127, 116, 138, 128, 133, 122, 131, 128, 140, 138, 134,
       120, 126, 109, 137, 111, 115, 117, 130, 113, 126, 115, 124,
       125, 118, 115, 128, 123, 129, 128, 120, 115, 134, 118, 135,
       134]

start = 102
step = 4

# Размах
print("Размах:", max(arr)-min(arr))

# Считание
arr.sort()
IntervalsNumber = math.ceil((max(arr)-start)/step) # Вычисление кол-ва интервалов:
print("\t x\t|\t n\t|\t n_i/N")
vers = []
amounts = []
for i in range(IntervalsNumber):
    inter = start + i*step
    amount = 0
    s = inter
    while s < inter+4:
        try:
            arr.remove(s)
            amount += 1
            s -= 1
        except ValueError:
            s += 1
            continue
    ver = round(amount/N, 4)
    vers.append(ver)
    sumVer = round(sum(vers), 4)
    amounts.append(amount)
    sumAmount = sum(amounts)
    print("\t{:}\t|\t{:}\t|\t {:}".format(inter, amount, ver))


print("\tsum:\t|\t{:}\t|\t {:}".format(sumAmount, sumVer))
